---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures
source: html/867de64e-62f4-3fe9-84da-cc769a28fea1.htm
---
# BuiltInFailures.GenericMEPFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.